{
        "intents": [
          {
            "tag": "greeting",
            "patterns": ["Hi", "Hello", "Good day", "Hey", "What's up", "Good morning", "Good evening", "Hello HRBotix", "Hi HRBotix"],
            "responses": ["Hello! Welcome to HRBotix.", "Hi there, how can HRBotix assist you today?", "Good to see you! How can HRBotix help you in your job search?"],
            "context_set": ""
          },
          {
            "tag": "goodbye",
            "patterns": ["Goodbye", "See you later", "Bye", "I have to go", "Talk to you later", "Catch you later", "I'm leaving"],
            "responses": ["Goodbye! Wishing you success in your job search.", "Talk to you later! HRBotix is always here to help.", "Goodbye! Feel free to come back for more job search tips."],
            "context_set": ""
          },
          {
            "tag": "cv_advice",
            "patterns": [
              "How can I improve my CV?",
              "Tips for writing a CV",
              "How to make my CV stand out",
              "What should I include in my CV?",
              "How to format a CV",
              "Best CV templates",
              "What skills to add in a CV",
              "Should I include a photo in my CV?",
              "How long should my CV be?",
              "CV tips for fresh graduates",
              "How to write a CV objective",
              "What to put in the skills section of a CV",
              "How to handle employment gaps in a CV",
              "Should I include references in my CV?",
              "What font should I use for my CV?"
            ],
            "responses": [
              "Make sure to include relevant experience and use bullet points to list your achievements.",
              "Use a clean, professional format and highlight your key skills and achievements.",
              "Tailor your CV for each job application to match the job requirements.",
              "Include sections such as contact information, summary, experience, education, skills, and certifications.",
              "Avoid using too many graphics or colors. Stick to a professional, easy-to-read format.",
              "Ensure your employment history is accurate and include any volunteer work or freelance projects.",
              "List skills that are relevant to the job you're applying for. Use keywords from the job description.",
              "It's not necessary to include a photo unless the employer specifically asks for it.",
              "Ideally, your CV should be one to two pages long.",
              "As a fresh graduate, focus on your education, internships, projects, and relevant skills.",
              "Write a concise statement that summarizes your career goals and aspirations.",
              "Include both hard and soft skills, such as technical skills, communication, and teamwork.",
              "Address them honestly and focus on the skills and experiences gained during that time.",
              "Only include references if the employer requests them. Otherwise, save space for other valuable information.",
              "Use a clean, easy-to-read font like Arial or Calibri. Avoid decorative fonts that may be difficult to read."
            ],
            "context_set": ""
          },
          {
            "tag": "skill_improvement",
            "patterns": [
              "How can I improve my skills?",
              "What skills are in demand?",
              "How to learn new skills for a job",
              "Best online courses for skill development",
              "What technical skills should I learn?",
              "How to improve my communication skills",
              "How to enhance my leadership skills",
              "What are soft skills and how to improve them",
              "Top skills employers look for",
              "How to become proficient in Excel",
              "How to improve my programming skills",
              "How to develop analytical skills",
              "How to improve time management skills",
              "How to gain industry-specific skills",
              "What are transferable skills and how to develop them",
              "How to become a better team player",
              "How to develop critical thinking skills",
              "How to enhance problem-solving skills",
              "How to improve presentation skills",
              "How to become more creative"
            ],
            "responses": [
              "Identify the skills required for your desired job and take relevant online courses.",
              "Currently, skills in data analysis, programming, digital marketing, and project management are in high demand.",
              "Enroll in online platforms like Coursera, Udemy, or LinkedIn Learning to learn new skills.",
              "Technical skills such as programming, data analysis, and cybersecurity are highly valued.",
              "Practice public speaking, join a communication workshop, and get feedback from peers.",
              "Take on leadership roles in group projects and seek mentorship from experienced leaders.",
              "Soft skills include communication, teamwork, and problem-solving. Practice these in real-world situations.",
              "Employers often look for problem-solving, adaptability, and technical proficiency.",
              "Take online courses on Excel, practice regularly, and use Excel in your daily tasks.",
              "Work on projects, participate in coding challenges, and review others' code to improve your programming skills.",
              "Practice logic puzzles, take up data analysis challenges, and analyze trends in your field.",
              "Set goals, prioritize tasks, and use tools like calendars and to-do lists to manage your time effectively.",
              "Join industry-related forums, attend workshops, and participate in online communities.",
              "Identify common skills across industries, such as communication and leadership, and develop them through practice.",
              "Collaborate with diverse teams, seek feedback, and contribute actively to group projects.",
              "Engage in debates, solve brain teasers, and analyze complex problems to enhance critical thinking.",
              "Use problem-solving frameworks like the 5 Whys or brainstorming to tackle challenges effectively.",
              "Practice delivering presentations, use visual aids effectively, and work on engaging your audience.",
              "Explore different perspectives, brainstorm ideas, and experiment with new approaches to problem-solving."
            ],
            "context_set": ""
          },
          {
            "tag": "interview_tips",
            "patterns": [
              "How to prepare for an interview",
              "Common interview questions",
              "How to answer behavioral interview questions",
              "What to wear to an interview",
              "How to make a good impression in an interview",
              "How to handle difficult interview questions",
              "Questions to ask in an interview",
              "How to follow up after an interview",
              "How to reduce interview anxiety",
              "Tips for virtual interviews",
              "How to negotiate salary in an interview",
              "How to prepare for a technical interview",
              "How to answer 'Tell me about yourself'",
              "How to explain employment gaps in an interview",
              "How to demonstrate problem-solving skills in an interview",
              "How to showcase leadership skills in an interview",
              "How to handle a panel interview",
              "What not to say in an interview",
              "How to prepare for a phone interview",
              "How to handle a video interview"
            ],
            "responses": [
              "Research the company, practice common interview questions, and prepare your answers.",
              "Common questions include 'Tell me about yourself,' 'Why do you want this job?' and 'What are your strengths and weaknesses?'",
              "Use the STAR method (Situation, Task, Action, Result) to structure your answers to behavioral questions.",
              "Dress professionally, in line with the company's culture.",
              "Arrive on time, be polite, and show enthusiasm for the role.",
              "Stay calm, take a moment to think, and answer honestly.",
              "Ask about the team, company culture, and next steps in the hiring process.",
              "Send a thank-you email within 24 hours, expressing your appreciation for the opportunity.",
              "Practice deep breathing, visualize success, and prepare thoroughly to reduce anxiety.",
              "Ensure you have a quiet space, test your technology beforehand, and dress professionally for virtual interviews.",
              "Do your research on industry salary standards, and be prepared to discuss your expected salary range.",
              "Review common technical interview questions, practice coding problems, and revise key concepts.",
              "Summarize your background, highlight relevant experiences, and express your enthusiasm for the role.",
              "Be honest and focus on what you learned during that time. Highlight any relevant experiences or skills gained.",
              "Use examples from past experiences to demonstrate your problem-solving approach.",
              "Share stories of how you led teams, solved problems, and achieved results.",
              "Address each panel member, maintain eye contact, and engage with all interviewers.",
              "Avoid negative language or criticism of past employers. Stay positive and professional.",
              "Prepare notes, research the company, and practice answering common phone interview questions.",
              "Ensure you have a quiet, well-lit space, dress professionally, and maintain eye contact with the camera."
            ],
            "context_set": ""
          },
          {
            "tag": "job_search",
            "patterns": [
              "How to find job postings on HRBotix",
              "Can you help me find a job?",
              "How do I search for jobs?",
              "How to apply for jobs on HRBotix",
              "Tips for job searching",
              "Best job search strategies",
              "How to network for a job",
              "How to use LinkedIn for job search",
              "What job boards should I use?",
              "How to tailor my resume for a job application",
              "How to write a cover letter",
              "How to search for remote jobs",
              "How to find entry-level jobs",
              "How to find internships",
              "What industries are hiring",
              "How to search for jobs by location",
              "How to stand out in job applications",
              "How to approach companies directly for jobs",
              "How to get noticed on job boards",
              "How to use social media for job search"
            ],
            "responses": [
              "Use the search bar on HRBotix to find job postings relevant to your skills and experience.",
              "Yes, I can help you find a job. What type of job are you looking for?",
              "Enter keywords related to the job you're seeking in the HRBotix search bar.",
              "Create an account, upload your resume, and apply directly to job postings on HRBotix.",
              "Set up job alerts, network with professionals in your industry, and customize your applications.",
              "Be proactive, apply consistently, and follow up on your applications.",
              "Attend networking events, join professional groups, and connect with industry professionals.",
              "Optimize your profile, connect with industry professionals, and apply for jobs through LinkedIn.",
              "Popular job boards include Indeed, LinkedIn, Glassdoor, and HRBotix.",
              "Match your resume with the job description and highlight relevant experience and skills.",
              "Write a concise cover letter that highlights your qualifications and interest in the job.",
              "Use filters on job boards to search for remote positions and include 'remote' in your keyword search.",
              "Look for positions labeled as 'entry-level' or 'junior' and focus on gaining relevant experience.",
              "Search for internships on job boards, company websites, and through university career services.",
              "Industries such as technology, healthcare, and e-commerce are currently hiring.",
              "Filter job search results by location and consider remote work options.",
              "Customize your applications, highlight your achievements, and tailor your resume to each job posting.",
              "Research companies you're interested in, reach out to hiring managers, and express your interest in working for them.",
              "Use keywords related to your skills and experience, and regularly update your profile on job boards.",
              "Share your job search journey on social media, connect with recruiters, and engage with industry-related content."
            ],
            "context_set": ""
          }
        ]
      }
      